using System;
using System.Collections.Generic;
using System.Linq;
using System.Web;

namespace Telerik.ILS.Web.StudentsPortal.Areas.Courses.ViewModels.ExamFileEvaluations
{
    public class Databases2013ExamEvaluationViewModel
    {
        public static List<Criteria> GetCriterias()
        {
            return new List<Criteria>
            {
                new Criteria("SPA Application", "", new List<Option>()),
                new Criteria("Приложението е Single Page Application", 
                    "Можете да навигирате без да рефрешвате цялата страница", new List<Option>
                    {
                        new Option("Коректно (4)", 4),
                        new Option("Почти коректно (3)", 3),
                        new Option("Частично коректно (2)", 2),
                        new Option("Предимно грешно (1)", 1),
                        new Option("Напълно грешно или липсващо (0)", 0),
                    }),
                new Criteria("Приложението е написано предимно на AngularJS", 
                    "Не са използвани други библиотеки за SPA", new List<Option>
                    {
                        new Option("Коректно (4)", 4),
                        new Option("Почти коректно (3)", 3),
                        new Option("Частично коректно (2)", 2),
                        new Option("Предимно грешно (1)", 1),
                        new Option("Напълно грешно или липсващо (0)", 0),
                    }),
                new Criteria("Приложението има поне три контролера (без да броим тези за потребители)", 
                    "Например за пътувания, за шофьори, за създаване на пътуване и т.н.", new List<Option>
                    {
                        new Option("Коректно (4)", 4),
                        new Option("Почти коректно (3)", 3),
                        new Option("Частично коректно (2)", 2),
                        new Option("Предимно грешно (1)", 1),
                        new Option("Напълно грешно или липсващо (0)", 0),
                    }),
                new Criteria("Приложението има поне три директиви", 
                    "Например за различните таблици, за формите и т.н.", new List<Option>
                    {
                        new Option("Коректно (4)", 4),
                        new Option("Почти коректно (3)", 3),
                        new Option("Частично коректно (2)", 2),
                        new Option("Предимно грешно (1)", 1),
                        new Option("Напълно грешно или липсващо (0)", 0),
                    }),
                new Criteria("Приложението има поне един филтър", 
                    "Различен от вградените в AngularJS - например за филтриране на шофьори", new List<Option>
                    {
                        new Option("Коректно (2)", 2),
                        new Option("Частично коректно (1)", 1),
                        new Option("Напълно грешно или липсващо (0)", 0),
                    }),
                new Criteria("Приложението има поне 4 сървиса", 
                    "За достъп на данни, за глобален хендлър за грешки, интерсептор и т.н.", new List<Option>
                    {
                        new Option("Коректно (4)", 4),
                        new Option("Почти коректно (3)", 3),
                        new Option("Частично коректно (2)", 2),
                        new Option("Предимно грешно (1)", 1),
                        new Option("Напълно грешно или липсващо (0)", 0),
                    }),
                new Criteria("Приложението визуализира коректно грешките, идващи от сървъра", 
                    "Сгрешена парола, грешни данни и т.н.", new List<Option>
                    {
                        new Option("Коректно (2)", 2),
                        new Option("Частично коректно (1)", 1),
                        new Option("Напълно грешно или липсващо (0)", 0),
                    }),
                new Criteria("Датите в приложението са написани в лесно четим за хората вид", 
                    "Например както е на приложените картинки", new List<Option>
                    {
                        new Option("Коректно (2)", 2),
                        new Option("Частично коректно (1)", 1),
                        new Option("Напълно грешно или липсващо (0)", 0),
                    }),
                new Criteria("Приложението е написано с качествен програмен код", 
                    "Модуларност, намеинования, четимост, форматиране и т.н.", new List<Option>
                    {
                        new Option("Коректно (0)", 0),
                        new Option("Частично коректно (-2.5)", -2.5),
                        new Option("Напълно грешно или липсващо (-5)", -5),
                    }),

                new Criteria("Route /", "", new List<Option>()),
                new Criteria("Заглавната страница показва 10-те публични пътувания, които сървъра изпраща", 
                    "Визуализира се цялата информация и има линкове към детайли на пътувания", new List<Option>
                    {
                        new Option("Коректно (2)", 2),
                        new Option("Частично коректно (1)", 1),
                        new Option("Напълно грешно или липсващо (0)", 0),
                    }),
                new Criteria("Заглавната страница показва 10-те публични шофьора, които сървъра изпраща", 
                    "Визуализира се цялата информация и има линкове към детайли на шофьори", new List<Option>
                    {
                        new Option("Коректно (2)", 2),
                        new Option("Частично коректно (1)", 1),
                        new Option("Напълно грешно или липсващо (0)", 0),
                    }),
                new Criteria("Заглавната страница статистиката на приложението коректно", 
                    "Има имплементиран кеш и резултатите не се дърпат от сървъра до рефреш", new List<Option>
                    {
                        new Option("Коректно (2)", 2),
                        new Option("Частично коректно (1)", 1),
                        new Option("Напълно грешно или липсващо (0)", 0),
                    }),

                new Criteria("Route /unauthorized", "", new List<Option>()),
                new Criteria("Когато неоторизиран потребител се опитва да достъпи част от сайта, която не е публична, е редиректнат към unauthorized", 
                    "Няма достъп до непубличните страници", new List<Option>
                    {
                        new Option("Коректно (4)", 4),
                        new Option("Почти коректно (3)", 3),
                        new Option("Частично коректно (2)", 2),
                        new Option("Предимно грешно (1)", 1),
                        new Option("Напълно грешно или липсващо (0)", 0),
                    }),

                new Criteria("Route /register", "", new List<Option>()),
                new Criteria("При регистрация потребителите могат да избират дали са шофьори или не", 
                    "Например с checkbox", new List<Option>
                    {
                        new Option("Коректно (2)", 2),
                        new Option("Частично коректно (1)", 1),
                        new Option("Напълно грешно или липсващо (0)", 0),
                    }),
                new Criteria("Когато потребител избере, че иска да бъде шофьор, има възможност да добави кола", 
                    "Например с текстово поле", new List<Option>
                    {
                        new Option("Коректно (2)", 2),
                        new Option("Частично коректно (1)", 1),
                        new Option("Напълно грешно или липсващо (0)", 0),
                    }),
                new Criteria("Формата за регистрация се валидира успешно", 
                    "Например за задължителни полета, за email регулярен израз и т.н.", new List<Option>
                    {
                        new Option("Коректно (2)", 2),
                        new Option("Частично коректно (1)", 1),
                        new Option("Напълно грешно или липсващо (0)", 0),
                    }),

                new Criteria("Route /drivers (публичната част)", "", new List<Option>()),
                new Criteria("Публичната част показва същите 10 шофьора като на заглавната страница", 
                    "Не позволява филтриране, сортиране, пейджиране и т.н.", new List<Option>
                    {
                        new Option("Коректно (2)", 2),
                        new Option("Частично коректно (1)", 1),
                        new Option("Напълно грешно или липсващо (0)", 0),
                    }),

                new Criteria("Route /trips (публичната част)", "", new List<Option>()),
                new Criteria("Публичната част показва същите 10 пътувания като на заглавната страница", 
                    "Не позволява филтриране, сортиране, пейджиране и т.н.", new List<Option>
                    {
                        new Option("Коректно (2)", 2),
                        new Option("Частично коректно (1)", 1),
                        new Option("Напълно грешно или липсващо (0)", 0),
                    }),

                new Criteria("Route /drivers (непубличната част)", "", new List<Option>()),
                new Criteria("Непубличната част позволява възможност за сървърно пейджиране", 
                    "С text input, с бутони, с директно презареждане на страниците или не", new List<Option>
                    {
                        new Option("Коректно (4)", 4),
                        new Option("Почти коректно (3)", 3),
                        new Option("Частично коректно (2)", 2),
                        new Option("Предимно грешно (1)", 1),
                        new Option("Напълно грешно или липсващо (0)", 0),
                    }),
                new Criteria("Непубличната част позволява възможност за сървърно филтриране по потребителско име", 
                    "С text input, с бутони, с директно презареждане на страниците или не", new List<Option>
                    {
                        new Option("Коректно (4)", 4),
                        new Option("Почти коректно (3)", 3),
                        new Option("Частично коректно (2)", 2),
                        new Option("Предимно грешно (1)", 1),
                        new Option("Напълно грешно или липсващо (0)", 0),
                    }),

                new Criteria("Route /drivers/:id", "", new List<Option>()),
                new Criteria("Детайлната информация за шофьора показва неговата информация коректно", 
                    "Предстоящи пътувания, общ брой пътувания", new List<Option>
                    {
                        new Option("Коректно (2)", 2),
                        new Option("Частично коректно (1)", 1),
                        new Option("Напълно грешно или липсващо (0)", 0),
                    }),
                new Criteria("Детайлната информация за шофьора показва табличка с пътувания, в които той участва", 
                    "Тези, които сървъра връща", new List<Option>
                    {
                        new Option("Коректно (2)", 2),
                        new Option("Частично коректно (1)", 1),
                        new Option("Напълно грешно или липсващо (0)", 0),
                    }),
                new Criteria("Пътуванията на шофьора могат да бъдат филтрирани на клиента по текущ логнат потребител", 
                    "Текущия логнат потребител като шофьор", new List<Option>
                    {
                        new Option("Коректно (2)", 2),
                        new Option("Частично коректно (1)", 1),
                        new Option("Напълно грешно или липсващо (0)", 0),
                    }),
                new Criteria("Пътуванията на шофьора могат да бъдат филтрирани на клиента и показани само тези, в които той е шофьор", 
                    "Премахва пътуванията, в които шофьора е пътник", new List<Option>
                    {
                        new Option("Коректно (2)", 2),
                        new Option("Частично коректно (1)", 1),
                        new Option("Напълно грешно или липсващо (0)", 0),
                    }),
                new Criteria("Пътуванията на шофьора могат да бъдат сортирани на клиента", 
                    "По 'from', 'to' и 'descending departure time', използвайки dropdown list", new List<Option>
                    {
                        new Option("Коректно (2)", 2),
                        new Option("Частично коректно (1)", 1),
                        new Option("Напълно грешно или липсващо (0)", 0),
                    }),

                new Criteria("Route /trips (непубличната част)", "", new List<Option>()),
                new Criteria("Непубличната част позволява възможност за сървърно пейджиране", 
                    "С text input, с бутони, с директно презареждане на страниците или не", new List<Option>
                    {
                        new Option("Коректно (4)", 4),
                        new Option("Почти коректно (3)", 3),
                        new Option("Частично коректно (2)", 2),
                        new Option("Предимно грешно (1)", 1),
                        new Option("Напълно грешно или липсващо (0)", 0),
                    }),
                new Criteria("Непубличната част позволява възможност за сървърно филтриране по вече свършили пътувания", 
                    "С text input, с бутони, с директно презареждане на страниците или не", new List<Option>
                    {
                        new Option("Коректно (2)", 2),
                        new Option("Частично коректно (1)", 1),
                        new Option("Напълно грешно или липсващо (0)", 0),
                    }),
                new Criteria("Непубличната част позволява възможност за сървърно филтриране по текущ логнат потребител", 
                    "С text input, с бутони, с директно презареждане на страниците или не", new List<Option>
                    {
                        new Option("Коректно (2)", 2),
                        new Option("Частично коректно (1)", 1),
                        new Option("Напълно грешно или липсващо (0)", 0),
                    }),
                new Criteria("Непубличната част позволява възможност за сървърно филтриране по 'from' и 'to' градове", 
                    "Използвайки dropdown list и сървиса /api/cities", new List<Option>
                    {
                        new Option("Коректно (4)", 4),
                        new Option("Почти коректно (3)", 3),
                        new Option("Частично коректно (2)", 2),
                        new Option("Предимно грешно (1)", 1),
                        new Option("Напълно грешно или липсващо (0)", 0),
                    }),
                new Criteria("Непубличната част позволява възможност за сървърно сортиране по 'driver', 'date', 'numberOfSeats', 'from', 'to'", 
                    "В нарастващ и намаляващ ред", new List<Option>
                    {
                        new Option("Коректно (4)", 4),
                        new Option("Почти коректно (3)", 3),
                        new Option("Частично коректно (2)", 2),
                        new Option("Предимно грешно (1)", 1),
                        new Option("Напълно грешно или липсващо (0)", 0),
                    }),
                new Criteria("Полето isMine в таблицата се визуализира с картинка", 
                    "А не пише просто true и false", new List<Option>
                    {
                        new Option("Коректно (2)", 2),
                        new Option("Частично коректно (1)", 1),
                        new Option("Напълно грешно или липсващо (0)", 0),
                    }),

                new Criteria("Route /trips/create", "", new List<Option>()),
                new Criteria("Формата позволява попълване на 'from', 'to', 'numberOfSeats' и 'departureTime' полетата", 
                    "И позволява успешно създаване на пътуване", new List<Option>
                    {
                        new Option("Коректно (4)", 4),
                        new Option("Почти коректно (3)", 3),
                        new Option("Частично коректно (2)", 2),
                        new Option("Предимно грешно (1)", 1),
                        new Option("Напълно грешно или липсващо (0)", 0),
                    }),
                new Criteria("'from' и 'to' градовете могат да бъдат избирани от dropdown list", 
                    "Използвайки сървиса /api/cities", new List<Option>
                    {
                        new Option("Коректно (4)", 4),
                        new Option("Почти коректно (3)", 3),
                        new Option("Частично коректно (2)", 2),
                        new Option("Предимно грешно (1)", 1),
                        new Option("Напълно грешно или липсващо (0)", 0),
                    }),
                new Criteria("'availableSeats' използва numeric text box", 
                    "Стандартен или от външна библиотека", new List<Option>
                    {
                        new Option("Коректно (1)", 1),
                        new Option("Частично коректно (0.5)", 0.5),
                        new Option("Напълно грешно или липсващо (0)", 0),
                    }),
                new Criteria("'departureTime' използва date time picker", 
                    "От външна библиотека през директива", new List<Option>
                    {
                        new Option("Коректно (1)", 1),
                        new Option("Частично коректно (0.5)", 0.5),
                        new Option("Напълно грешно или липсващо (0)", 0),
                    }),
                new Criteria("Формата за регистрация се валидира успешно", 
                    "Например за задължителни полета, за минимален брой свободни пътници и т.н.", new List<Option>
                    {
                        new Option("Коректно (2)", 2),
                        new Option("Частично коректно (1)", 1),
                        new Option("Напълно грешно или липсващо (0)", 0),
                    }),

                new Criteria("Route /trips/:id", "", new List<Option>()),
                new Criteria("Детайлната информация за пътуването показва неговата информация коректно", 
                    "Градовете, броя свободни места и имената на пътниците", new List<Option>
                    {
                        new Option("Коректно (2)", 2),
                        new Option("Частично коректно (1)", 1),
                        new Option("Напълно грешно или липсващо (0)", 0),
                    }),
                new Criteria("Възможност за текущия потребител да се добави към пътуващите", 
                    "Работи коректно и изпраща вярна информация на сървъра", new List<Option>
                    {
                        new Option("Коректно (2)", 2),
                        new Option("Частично коректно (1)", 1),
                        new Option("Напълно грешно или липсващо (0)", 0),
                    }),
                new Criteria("Бутона за добавяне към пътуване се валидира", 
                    "Валидира текущата дата, бройката свободни места, дали вече този потребител не записан", new List<Option>
                    {
                        new Option("Коректно (2)", 2),
                        new Option("Частично коректно (1)", 1),
                        new Option("Напълно грешно или липсващо (0)", 0),
                    }),
			};
        }
    }
}